docs/benchmark/results-wrk2-c1000/raw/gateway-R100000-r3.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 2.507ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.549ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.516ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.503ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.56ms    1.23ms  10.54ms   67.92%
    Req/Sec    26.40k     4.85k   41.22k    68.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.49ms
 75.000%    3.36ms
 90.000%    4.14ms
 99.000%    5.89ms
 99.900%    7.22ms
 99.990%    8.62ms
 99.999%    9.69ms
100.000%   10.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       1.018     0.100000        37520         1.11
       1.452     0.200000        75052         1.25
       1.805     0.300000       112475         1.43
       2.155     0.400000       150141         1.67
       2.491     0.500000       187549         2.00
       2.661     0.550000       206350         2.22
       2.829     0.600000       225041         2.50
       2.997     0.650000       243799         2.86
       3.169     0.700000       262509         3.33
       3.357     0.750000       281261         4.00
       3.457     0.775000       290583         4.44
       3.565     0.800000       300063         5.00
       3.681     0.825000       309390         5.71
       3.811     0.850000       318753         6.67
       3.961     0.875000       328075         8.00
       4.045     0.887500       332788         8.89
       4.139     0.900000       337500        10.00
       4.243     0.912500       342250        11.43
       4.363     0.925000       346882        13.33
       4.499     0.937500       351479        16.00
       4.587     0.943750       353892        17.78
       4.679     0.950000       356236        20.00
       4.779     0.956250       358527        22.86
       4.895     0.962500       360862        26.67
       5.023     0.968750       363235        32.00
       5.087     0.971875       364386        35.56
       5.155     0.975000       365556        40.00
       5.231     0.978125       366731        45.71
       5.323     0.981250       367879        53.33
       5.451     0.984375       369059        64.00
       5.531     0.985938       369640        71.11
       5.643     0.987500       370236        80.00
       5.775     0.989062       370804        91.43
       5.979     0.990625       371401       106.67
       6.159     0.992188       371974       128.00
       6.239     0.992969       372272       142.22
       6.331     0.993750       372572       160.00
       6.423     0.994531       372861       182.86
       6.515     0.995313       373146       213.33
       6.619     0.996094       373442       256.00
       6.675     0.996484       373586       284.44
       6.743     0.996875       373731       320.00
       6.811     0.997266       373882       365.71
       6.895     0.997656       374028       426.67
       6.971     0.998047       374170       512.00
       7.019     0.998242       374251       568.89
       7.059     0.998437       374315       640.00
       7.111     0.998633       374389       731.43
       7.163     0.998828       374466       853.33
       7.231     0.999023       374535      1024.00
       7.275     0.999121       374575      1137.78
       7.311     0.999219       374608      1280.00
       7.355     0.999316       374644      1462.86
       7.455     0.999414       374681      1706.67
       7.559     0.999512       374719      2048.00
       7.611     0.999561       374737      2275.56
       7.667     0.999609       374754      2560.00
       7.711     0.999658       374772      2925.71
       7.771     0.999707       374791      3413.33
       7.859     0.999756       374810      4096.00
       7.915     0.999780       374819      4551.11
       7.959     0.999805       374827      5120.00
       8.035     0.999829       374836      5851.43
       8.123     0.999854       374847      6826.67
       8.247     0.999878       374856      8192.00
       8.447     0.999890       374859      9102.22
       8.647     0.999902       374864     10240.00
       8.719     0.999915       374868     11702.86
       9.007     0.999927       374873     13653.33
       9.287     0.999939       374878     16384.00
       9.327     0.999945       374880     18204.44
       9.415     0.999951       374882     20480.00
       9.447     0.999957       374884     23405.71
       9.479     0.999963       374887     27306.67
       9.575     0.999969       374889     32768.00
       9.591     0.999973       374890     36408.89
       9.655     0.999976       374891     40960.00
       9.671     0.999979       374892     46811.43
       9.679     0.999982       374895     54613.33
       9.679     0.999985       374895     65536.00
       9.679     0.999986       374895     72817.78
       9.687     0.999988       374896     81920.00
       9.687     0.999989       374896     93622.86
       9.791     0.999991       374897    109226.67
       9.951     0.999992       374898    131072.00
       9.951     0.999993       374898    145635.56
       9.951     0.999994       374898    163840.00
       9.951     0.999995       374898    187245.71
      10.151     0.999995       374899    218453.33
      10.151     0.999996       374899    262144.00
      10.151     0.999997       374899    291271.11
      10.151     0.999997       374899    327680.00
      10.151     0.999997       374899    374491.43
      10.543     0.999998       374900    436906.67
      10.543     1.000000       374900          inf
#[Mean    =        2.556, StdDeviation   =        1.230]
#[Max     =       10.536, Total count    =       374900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1437901 requests in 15.00s, 0.90GB read
Requests/sec:  95857.20
Transfer/sec:     61.25MB