docs/benchmark/results-wrk2-c1000/raw/gateway-R120000-r3.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.501ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.493ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.496ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.597ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.56ms  749.75us   7.94ms   70.79%
    Req/Sec    31.61k     2.53k   41.00k    70.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.44ms
 75.000%    1.99ms
 90.000%    2.55ms
 99.000%    3.72ms
 99.900%    5.43ms
 99.990%    7.11ms
 99.999%    7.68ms
100.000%    7.94ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.076     0.000000            1         1.00
       0.721     0.100000        45039         1.11
       0.916     0.200000        90175         1.25
       1.093     0.300000       135242         1.43
       1.267     0.400000       180154         1.67
       1.444     0.500000       225084         2.00
       1.533     0.550000       247600         2.22
       1.629     0.600000       270202         2.50
       1.740     0.650000       292522         2.86
       1.861     0.700000       315040         3.33
       1.993     0.750000       337622         4.00
       2.065     0.775000       348966         4.44
       2.137     0.800000       360003         5.00
       2.219     0.825000       371295         5.71
       2.311     0.850000       382590         6.67
       2.421     0.875000       393860         8.00
       2.483     0.887500       399429         8.89
       2.551     0.900000       405055        10.00
       2.631     0.912500       410629        11.43
       2.731     0.925000       416238        13.33
       2.851     0.937500       421905        16.00
       2.913     0.943750       424691        17.78
       2.981     0.950000       427576        20.00
       3.045     0.956250       430352        22.86
       3.107     0.962500       433131        26.67
       3.177     0.968750       435944        32.00
       3.217     0.971875       437383        35.56
       3.261     0.975000       438785        40.00
       3.313     0.978125       440160        45.71
       3.375     0.981250       441570        53.33
       3.459     0.984375       442968        64.00
       3.511     0.985938       443662        71.11
       3.569     0.987500       444361        80.00
       3.655     0.989062       445072        91.43
       3.771     0.990625       445773       106.67
       3.927     0.992188       446477       128.00
       4.019     0.992969       446826       142.22
       4.093     0.993750       447176       160.00
       4.167     0.994531       447550       182.86
       4.251     0.995313       447891       213.33
       4.335     0.996094       448229       256.00
       4.383     0.996484       448407       284.44
       4.451     0.996875       448582       320.00
       4.543     0.997266       448760       365.71
       4.675     0.997656       448932       426.67
       4.847     0.998047       449107       512.00
       4.943     0.998242       449198       568.89
       5.051     0.998437       449282       640.00
       5.147     0.998633       449375       731.43
       5.307     0.998828       449460       853.33
       5.455     0.999023       449547      1024.00
       5.547     0.999121       449592      1137.78
       5.687     0.999219       449635      1280.00
       5.811     0.999316       449678      1462.86
       5.947     0.999414       449724      1706.67
       6.063     0.999512       449766      2048.00
       6.179     0.999561       449788      2275.56
       6.255     0.999609       449811      2560.00
       6.319     0.999658       449833      2925.71
       6.443     0.999707       449854      3413.33
       6.531     0.999756       449876      4096.00
       6.623     0.999780       449887      4551.11
       6.707     0.999805       449898      5120.00
       6.807     0.999829       449909      5851.43
       6.863     0.999854       449920      6826.67
       6.991     0.999878       449931      8192.00
       7.071     0.999890       449936      9102.22
       7.135     0.999902       449942     10240.00
       7.171     0.999915       449947     11702.86
       7.195     0.999927       449953     13653.33
       7.267     0.999939       449958     16384.00
       7.323     0.999945       449961     18204.44
       7.339     0.999951       449964     20480.00
       7.403     0.999957       449966     23405.71
       7.471     0.999963       449969     27306.67
       7.499     0.999969       449972     32768.00
       7.523     0.999973       449973     36408.89
       7.563     0.999976       449975     40960.00
       7.571     0.999979       449977     46811.43
       7.571     0.999982       449977     54613.33
       7.615     0.999985       449979     65536.00
       7.615     0.999986       449979     72817.78
       7.651     0.999988       449980     81920.00
       7.679     0.999989       449982     93622.86
       7.679     0.999991       449982    109226.67
       7.679     0.999992       449982    131072.00
       7.679     0.999993       449982    145635.56
       7.783     0.999994       449983    163840.00
       7.783     0.999995       449983    187245.71
       7.783     0.999995       449983    218453.33
       7.811     0.999996       449984    262144.00
       7.811     0.999997       449984    291271.11
       7.811     0.999997       449984    327680.00
       7.811     0.999997       449984    374491.43
       7.811     0.999998       449984    436906.67
       7.939     0.999998       449985    524288.00
       7.939     1.000000       449985          inf
#[Mean    =        1.562, StdDeviation   =        0.750]
#[Max     =        7.936, Total count    =       449985]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1725619 requests in 15.00s, 1.08GB read
Requests/sec: 115035.71
Transfer/sec:     73.50MB